/* 1. ფუნქციის საშულებით გამოიტანეთ ყველა რიცხვის ჯამი: 
არგუმენტად გადაეცით ეს მასივი: 10, 50, 6, 7, 8, 11, 6, 3, 9 */

/* 2. ფუნქციამ უნდა დააბრუნოს სახელი და გვარი ადგილის გამოტოვებით 
(მაგ: 'giorgi saakadze') თუ isloggedin არის true და false თუ isloggedin ფროფერთი არის false;

  let user = {
    firstname: 'giorgi',
    lastname: 'saakadze',
    age: 32,
    isloggedin: true
  } */

/* 3. შექმენით ფუნქცია რომელსაც გადაეცემა ერთი პარამეტრი. 
ეს პარამეტრი უნდა იყოს რიცხვების მასივი და ფუნქციამ უნდა დააბრუნოს ამ რიცხვებიდან მაქსიმალური:
(აქ მეორე ვარიანტიც შეგვიძლია დავამატოთ ამ მასალით: https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Math/max ) */

/* 4. დაწერეთ ფუნქცია, რომელიც პარამეტრად მიიიღებს ერთ რიცხვს და გამოთვლის გადაცემული მნიშვნელობა კენტია თუ ლუწი; 
თუ ლუწია დააბრუნოს - this number is even‘; თუ კენტია დააბრუნოს - this number is odd‘ */

/* 5. მოცემულია მასივი:
let array = [1,2,3,4,5]; 
for ციკლის საშუალებით მიიღეთ reverse ვერისია, ანუ 5,4,3,2,1 */

/* 6. ფუნქციის საშუალებით გამოთვალეთ იუსერის ასაკი ( არგუმენტად გადაეცით ნებისმიერი რიცხვი) და დაამატეთ შემდეგი პირობა, 
თუ გადაცემული ასაკი მეტია 18- ზე დააბრუნეთ - სრულლოვანი, თუ ნაკელებია  დააბრუნეთ არასწულწლოვანი. 
ეს ამოცანა დაწერეთ arrow function-ით და if ის პირობა ჩაწერეთ ახალი სინტაქსით; */

/* 7. მოცემულია მასივი
let array2 = [1, 2, 3, 4, 5, 6, 7, 8, 9];
ციკლის საშუალებით შეამოწმეთ, თუ ამ მასივში არის რიცხვი 5 - მაშინ დალოგეთ - ‘არის’ და გააჩერეთ ციკლი. */

/* 8. მოცემულია მასივი:
let array3= [1, 2, 3, 4, 5];
ციკლის საშუალებით გამოთვალეთ რიცხვების ჯამი.  */

/* 9. მოცემულია მასივი
let array4= [1, 2, 3, 4, 5];
ციკლის საშუალებით გამოთვალეთ საშუალო არითმტიკული (ჯამი გავყოთ ელემნტების რაოდენობაზე). */

/* 10. მოცემულია მასივი
გამოიტანეთ ყველა რიცხვი 7 ის გარდა ( continue)
 let array5 = [1, 2, 3, 7, 6, 9];
 */

/* 11. Მოცემული მასივიდან ამოიღეთ მხოლოდ ციფრები, რომლებიც 5-ის ჯერადია:
Let array7 = [32, 14, null, ‘40’, 50]; */

/* 12. Მოცემული მასივიდან კონსოლში გამოიტანეთ მხოლოდ დადებითი რიცხვები:
Let array8 = [ [2, -3, 5, 11], [1, -35, –11], [12, -36, -24] ]; */
